#!/dev/null

$product_name = "Guitar"
$copyright_year = 2019
$version_a = 1
$version_b = 1
$version_c = 999
$version_d = 0


# v1.1.1 2019-09-xx
# - ダークテーマ描画修正
# - 初回起動時のウェルカムダイアログボックスの改良
# - 小さな修正
#
# v1.1.0 2019-09-01
# - 中国語対応
# -	日本語翻訳ファイルのtypo修正
# -	Windows版インストーラー対応
# - ファイルリストのバッジを描画
# - コミットグラフで異なるブランチの線が重なって描画されることがあった問題を修正
# - コミットグラフで先祖のブランチを強調表示する機能
# - ダークテーマの描画を改良
# - Ctrl+HでHEADにジャンプする
# - fetch tags -f コマンド
# - 新マージダイアログ
# - チェリーピックダイアログ
#
# v1.0.0 2019-06-01
# -	ロシア語対応
# -	細かい修正
#
# v0.9.3 2019-01-19
# -	stashコマンドを実装
# -	GitHubウェブページからのドラッグアンドドロップ動作を改良
# -	メニューバー項目を整理
#
# v0.9.2 2018-11-06
# -	定期的リモート監視機能
# -	ソースコードリファクタリング
# -	安定性向上
# -	cmake対応
#
# v0.9.1 2018-11-06
# -	support ssh key with passphrase
#
# v0.9.0 2018-10-24
# -	
#
# v0.2.0 2017-12-18
# -	
#
# v0.1.0 2017-05-03
# -	
#
# v0.0.0 2016-12-25
# -	alpha release
